advanced/common/models/User.php

SELECT * FROM `user` WHERE (`id`=1) AND (`status`=10)
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => 1]);

SELECT * FROM `user` WHERE (`username`='admin123') AND (`status`=10)
---
    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username, 'status' => 1]);